# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

list = [None, 125, 'Urok#2', ('2', 'b'), ['2', 'b'], 2.5]
for l in list:
    print(f'{l}, {type(l)}')





