# 1. Поработайте с переменными, создайте несколько, выведите на экран,
#    запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

# Поработайте с переменными, создайте несколько, выведите на экран
a = 1
b = 5
print("Переменные:", a, ",", b)

# Запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
fio = input("Введите свое ФИО:")
gr = input("Введите свой год рождения:")
gor = input("В каком городе вы живете?")
print("Ваше имя:", fio)
print("Ваш год рождения:", gr)
print("Город вашего проживания:", gor)
