# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.

def my_func(x, y):
    return 1 / x ** abs(y)

x = int(input("Введите число, которое нужно возвести в степень: "))
y = int(input("Введите число, в какую степень возвести: "))

print(f'Ответ: {my_func(x, y)}')